[[true,"web agent","definition","Software that displays web pages and other assets in a window.","T1459260204327"],[true,"query","definition","A query finds values in a database or other collection of facts subject to the given constraints. It is specified in the Query docs.","T1459260204327"],[true,"glossary","words",["value","attribute","entity","database","partition","information","outformation","transaction","fact","datom","query","web agent"],"T1459264256393"],[true,"database","definition","A database is a set of datoms.\n","T1459263716960"],[true,"partition","definition","A logical grouping of entities in a database. Partitions have unique qualified names. Every entity belongs to a partition that is assigned when the entity is created.&nbsp;<br>","T1459260204327"],[true,"datom","definition","An atomic fact in a database, composed of entity, attribute, value, transaction and added. Pronounced like \"datum\", but pluralizes as datoms.","T1459260204327"],[true,"value","definition","Something that does not change. \n\nThe number 42 is a value because it always represents the number 42. The date 2012-02-29 is a value because it always represents the same instant in time. \n\nA datom relates an entity to a value through an attribute.","T1459260204327"],[true,"entity","definition","The first component of a datom, specifying who or what the datom is about. \n\nAlso the collection of datoms associated with a single entity.","T1459260204327"],[true,"information","definition","Formation of facts in the mind.\n\nWhat is conveyed or represented by a particular arrangement or sequence of things.\n\nInformation occurs in the mind. Outformations occur out in space.","T1459260204327"],[true,"attribute","definition","Something that can be said about an entity. \n\nAn attribute has a name like \"postal code\" or \"subtotal\" that describes how a value relates to an entity.","T1459263700333"],[true,"transaction","definition","An atomic unit of work in a database. All Datomic writes are transactional and have the ACID properties (Atomic, Consistent, Isolated, and Durable).<br><br>An entity representing a transaction. Every datom in a Datomic database includes the tx that created it, allowing recovery of the entire history of the database. Transactions are automatically associated with wall-clock time, but are otherwise ordinary entities. In particular, application code can make additional assertions about transactions. A tx entity id can be converted to a transaction t with Peer.toT.<br>","T1459260204327"],[true,"outformation","definition","A data formation that occurs in space. Outformations occur in space. Information occurs in the mind.","T1459260204327"],[true,"fact","definition","A piece of information used as evidence. Knowledge that something happened.<br><br>See also: datom.<br>","T1459260204327"]]
